tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "federico-terzi/espanso"

brew "git"
brew "openssh"
brew "openssl"
brew "neovim"
brew "direnv"
brew "autojump"
brew "ripgrep"
brew "fzf"
brew "tig"
brew "thefuck"
brew "espanso"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "tmux"

brew "watch"
brew "tree"
brew "flyway"
brew "rabbitmq"
brew "memcached"

brew "cask"

cask "kitty"
cask "alacritty"
cask "barrier"
cask "google-chrome"
cask "zoom"
cask "tuple"
cask "cakebrew"
cask "docker"
cask "postgres-unofficial" # postgresapp.com
cask "jpadilla-redis"
cask "dropbox"
cask "syncthing"
cask "keybase"
cask "istat-menus" # todo: set up license activation
cask "font-fira-code"
cask "font-iosevka-nerd-font"
cask "visual-studio-code"
cask "insomnia"
# cask "intellij-idea" # pending: uninstall download version
cask "dotnet-sdk"
cask "discord"

brew "mas"

mas "Amphetamine", id: 937984704
mas "1Password 7 - Password Manager", id: 1333542190
cask "1password-cli"

mas "XCode", id: 497799835
mas "Postico", id: 1031280567
mas "Red - UI for Redis", id: 1491764008

mas "Bitwarden", id: 1352778147
brew "bitwarden-cli"

mas "Tailscale", id: 1475387142
mas "Alfred", id: 405843582
mas "SwordSoft Screenink", id: 556304449

mas "Slack for Desktop", id: 803453959  
