tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "federico-terzi/espanso"
tap "buildpacks/tap"

brew "git"
brew "git-lfs"
brew "openssh"
brew "openssl"
brew "yamllint"
brew "neovim"
brew "tmate"
brew "vint"
brew "direnv"
brew "autojump"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "tig"
brew "thefuck"
brew "espanso"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "tldr"
brew "jq"
brew "yq"
brew "cmake"
brew "ctags"
brew "nativefier"
brew "curl"
brew "wget"

brew "bat"
brew "watch"
brew "watchexec"
brew "tree"
brew "zopfli"

brew "mysql"
brew "pack"
brew "flyway"
brew "rabbitmq"
brew "memcached"
brew "prometheus"
brew "grafana"
brew "helm"

brew "cask"

cask "google-cloud-sdk"
cask "chronycontrol" # https://netfuture.ch/2021/12/transparent-trustworthy-time-with-ntp-and-nts/
cask "kitty"
cask "alacritty"
cask "barrier"
cask "amethyst"
cask "google-chrome"
cask "firefox"
cask "gimp"
cask "inkscape"
cask "licecap"
cask "zoom"
cask "skype"
cask "vlc"
cask "deezer"
cask "obs"
cask "soundsource"
cask "tuple"
cask "cakebrew"
cask "cheatsheet"
cask "docker"
cask "postgres-unofficial" # postgresapp.com
cask "jpadilla-redis"
cask "dropbox"
cask "syncthing"
cask "keybase"
cask "istat-menus" # todo: set up license activation
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-ibm-plex"
cask "font-victor-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "visual-studio-code"
cask "insomnia"
cask "postman"
# cask "intellij-idea" # pending: uninstall download version
cask "rider"
cask "datagrip"
cask "webstorm"
cask "dotnet-sdk"
cask "discord"
cask "obsidian"
cask "miro"
cask "nomachine"
cask "graphiql"

brew "mas"

mas "Amphetamine", id: 937984704
mas "1Password 7 - Password Manager", id: 1333542190
cask "1password-cli"
mas "AudioSwitcher", id: 561712678

mas "XCode", id: 497799835
mas "Postico", id: 1031280567
mas "Sequel Ace", id: 1518036000
mas "Red - UI for Redis", id: 1491764008

mas "Bitwarden", id: 1352778147
brew "bitwarden-cli"

mas "Recess", id: 621451282
mas "EasyRes", id: 688211836
mas "Tailscale", id: 1475387142
mas "Alfred", id: 405843582
mas "SwordSoft Screenink", id: 556304449

mas "Slack for Desktop", id: 803453959
