tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "federico-terzi/espanso"
tap "buildpacks/tap"
tap "git-duet/tap"
tap "clojure-lsp/brew"

brew "mise"
brew "git"
brew "git-lfs"
brew "git-duet"
brew "lazygit"
brew "gh"
brew "fossil"
brew "openssh"
brew "ssh-audit"
brew "openssl"
brew "yamllint"
brew "lua-language-server"
brew "neovim"
brew "helix"
brew "chafa" # used for image previews in neovim
brew "tmate"
# brew "mermaid-cli"
brew "glow"
brew "graphviz"
brew "vint"
brew "direnv"
# brew "autojump"
brew "zoxide"
brew "walk"
brew "lsd"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "tig"
brew "thefuck"
brew "espanso"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "mosh"
brew "tldr"
brew "jq"
brew "yq"
brew "jless"
brew "cmake"
brew "ctags"
brew "nativefier"
brew "curl"
brew "wget"
brew "dog"
brew "siege"


brew "bat"
brew "mdcat"
brew "watch"
brew "viddy" # https://github.com/sachaos/viddy
brew "watchexec"
brew "git-delta"
brew "nq"
brew "entr"
brew "tree"
brew "zopfli"
brew "graphicsmagick"

brew "mysql"
# brew "pack"
# brew "flyway"
# brew "rabbitmq"
# brew "memcached"
# brew "prometheus"
# brew "grafana"
brew "helm"
brew "terraform-ls"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "awscli"
brew "exercism"
# brew "imageoptim-cli"
brew "xcodegen"

brew "cask"

cask "backblaze"
cask "google-chrome"
cask "chromedriver"
cask "firefox"
cask "wooshy"
cask "jordanbaird-ice"
cask "raycast"
cask "kindavim"
cask "chronycontrol" # https://netfuture.ch/2021/12/transparent-trustworthy-time-with-ntp-and-nts/
cask "kitty"
cask "contour"
cask "amethyst"
cask "google-cloud-sdk"
cask "alacritty"
cask "barrier"
cask "keycastr"
cask "imageoptim"
cask "gimp"
cask "inkscape"
cask "licecap"
cask "zoom"
cask "skype"
cask "vlc"
cask "obs"
cask "soundsource"
cask "tuple"
cask "cakebrew"
cask "cheatsheet"
cask "docker"
cask "orbstack"
cask "lens"
cask "postgres-unofficial" # postgresapp.com
cask "jpadilla-redis"
cask "dropbox"
cask "syncthing"
cask "keybase"
cask "istat-menus" # todo: set up license activation
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-ibm-plex"
cask "font-victor-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "visual-studio-code"
cask "insomnia"
cask "postman"
cask "android-studio"
# cask "intellij-idea" # pending: uninstall download version
cask "rider"
cask "datagrip"
cask "webstorm"
# cask "dotnet-sdk"
cask "discord"
cask "signal"
cask "obsidian"
cask "ipfs"
cask "miro"
cask "figma"
cask "nomachine"
cask "graphiql"
cask "spotify"
cask "copilot-for-xcode"

brew "mas"

mas "Amphetamine", id: 937984704
mas "1Password 7 - Password Manager", id: 1333542190
cask "1password-cli"
# mas "AudioSwitcher", id: 561712678
mas "Shush - Microphone Manager", id: 496437906

mas "XCode", id: 497799835
mas "Postico", id: 1031280567
mas "Sequel Ace", id: 1518036000
mas "Red - UI for Redis", id: 1491764008

mas "Bitwarden", id: 1352778147
brew "bitwarden-cli"

mas "Recess", id: 621451282
mas "EasyRes", id: 688211836
mas "Tailscale", id: 1475387142
# mas "Alfred", id: 405843582
mas "SwordSoft Screenink", id: 556304449
mas "LocalSend", id: 1661733229 

mas "Slack for Desktop", id: 803453959

